# !pip install transformers sentencepiece pymorphy3 pandas nltk
# !pip install -U scikit-learn
# !pip install xlrd
# !pip install matplotlib
# !pip install numpy==1.21.6
import string
import numpy as np
from AI.db import take_from_bd, insert_category_theme
import nltk
#
# import ssl
#
# try:
#     _create_unverified_https_context = ssl._create_unverified_context
# except AttributeError:
#     pass
# else:
#     ssl._create_default_https_context = _create_unverified_https_context


# nltk.download('wordnet')
# nltk.download('punkt')
# nltk.download('stopwords')

from nltk.tokenize import word_tokenize
from nltk.corpus import stopwords

import pymorphy3

import re
# !pip install sentence_transformers
from sentence_transformers import SentenceTransformer

# !pip install tensorflow keras
import tensorflow as tf
from keras import backend as K
from keras.applications.vgg16 import VGG16
from keras.layers import Dense, Dropout, Input, Concatenate, concatenate, InputLayer
from keras.models import Model
from keras.models import Sequential
from keras.optimizers import Adamax

import os

model = SentenceTransformer('cointegrated/rubert-tiny2')


def remove_punctuation(text):
    return ''.join([ch for ch in text if ch not in string.punctuation])  # метод для удаления пунктуации


def remove_numbers(text):
    return ''.join([i if not i.isdigit() else ' ' for i in text])  # метод для удаления чисел


def remove_notalpha(text):
    # print(text)
    return ''.join(i if i.isalpha() else ' ' for i in text)  # метод для проверки на только алфавитные символы


def remove_space(text):
    return re.sub(r'\s+', ' ', text, flags=re.I)  # метод для удаления пробелов


w1 = {'слово', 'br', 'здравствуйте', 'день', 'год', 'это', 'добрый', 'пожалуйста', 'сказать', 'почему', 'г', 'мочь',
      'такой', 'который', 'какой', 'наш', 'быть', 'ещё', 'мы', 'один', 'должный', 'сегодня', 'хотеть', 'очень',
      'вообще', 'весь', 'просто', 'свой', 'всё', 'нужно', 'club', 'сам', 'новый', 'мой', 'кто', 'первый', 'неделя',
      'каждый', 'спасибо', 'так', 'вечер', 'час', 'утро', 'другой', 'пора', 'нужный', 'далее', 'сколько', 'этот',
      'второй', 'ваш', 'скорый', 'поставить', 'хотя', 'хотеться', 'тот', 'брать', 'сей', 'данный', 'стать', 'р', 'id',
      'январь', 'вчера', 'раз', 'лысьва', 'возможно', 'повод'}
def remove_stopwords(text):
    global w1
    w = stopwords.words("russian")
    return [word for word in text if word not in w and word not in w1] # удаление стоп-слов


def tokenize(text):
    t = word_tokenize(text)
    return t  # метод для токенизации


wn = nltk.WordNetLemmatizer()
morph = pymorphy3.MorphAnalyzer()


def lemmatize(text):
    global morph
    res = list()
    for word in text:
        p = morph.parse(word)[0]
        res.append(p.normal_form)
    return res  # метод для лемматизации


def part(text):
    global morph
    res = list()
    for word in text:
        p = morph.parse(word)[0]
        a = (word, p.tag.cyr_repr)
        res.append(tuple(a))
    return res  # метод для выделения значимых частей речи


y = ['★ Ямы во дворах', 'Оказание гос. соц. помощи', 'Дети и многодетные семьи', 'Содержание остановок',
     'Технические проблемы с записью на прием к врачу', 'Плата за вывоз ТКО', 'Образовательный процесс',
     'Диспансеризация', '★ Просьбы о лечении',
     '★ Нарушение правил очистки дорог от снега и наледи/Обращения о необходимости очистить тротуар от снега и наледи',
     'Предложение по благоустройству', 'Задержка выплат гражданам', 'Аварийное жилье/переселение',
     '★ Нарушение правил уборки от снега и наледи внутридворового проезда, тротуара, площади',
     'Жалобы на управляющие компании', 'Борщевик Сосновского', 'Пешеходные переходы и жд переезды',
     '★ Уборка/Вывоз мусора', 'Жалобы на врачей', 'Трудоустройство', 'Подтопление автомобильных дорог',
     'Тесты на коронавирус', '★ Оказание медицинской помощи не в полном объеме/отказ в оказании медицинской помощи',
     'Парки и зоны отдыха', 'Содержание больниц', 'Уборка территорий',
     '★ Отсутствие контейнерной площадки/Проезд к контейнерной площадке',
     'Благоустройство общественного пространства (парк, сквер, пешеходная зона, бульвар, набережная, центральная улица или площадь)',
     '★ Питание в медицинских учреждениях', 'Нехватка или сокращение врачей и медицинских учреждений',
     'Необходима установка и замена дорожных ограждений',
     '★ Ненадлежащее содержание зеленых насаждений (газонов)/деревьев и кустарников', 'Вырубка деревьев, кустарников',
     'Предложить установку нового лежачего полицейского (ИДН)', 'Цены и ценообразование', 'Учреждения культуры',
     'Профильный осмотр', 'Доступность вакцин', 'Плата за ЖКУ и работа ЕИРЦ', 'Культурно-досуговые мероприятия',
     'Отсутствие холодной воды', 'Ремонт/строительство мостов', 'Завышение платы за коммунальные услуги', 'Очередь',
     'Ненадлежащее качество или отсутствие отопления', 'Организация парковок', 'Ненадлежащая уборка подъездов и лифтов',
     'Коронавирус', 'Неудовлетворительные условия проезда в транспорте на действующем маршруте',
     'Содержание, ремонт и обустройство тротуаров', 'Отсутствие лекарств в аптеках', 'Порядок и пункты вакцинации',
     '★ Информационно-техническая поддержка', 'Восстановление газоснабжения', 'Отсутствие горячей воды',
     'Некачественный капитальный ремонт', 'Ошибки врачей, халатность', 'Создание доступной среды для инвалидов',
     '★ Неисправные фонари освещения', '★ Скорая помощь', 'Сборы за капитальный ремонт',
     '★ Открытые канализационные люки', 'Социальные учреждения', 'Безопасность общественных пространств',
     'Льготные лекарства', 'Проблемы с контейнерами', 'Ямы и выбоины на дороге', 'Дезинфекция МКД', 'Вакцинация',
     '★ Затопление подъездов, подвальных помещений', 'Строительство или реконструкция дорог',
     'Отсутствие фонарей освещения', 'Ремонт дороги', 'Занятость и трудоустройство',
     '★ Некачественно нанесенная разметка на проезжей части', 'Разрушение тротуаров и пешеходных дорожек',
     'Отсутствие детских площадок', 'Ливневые канализации (строительство и реконструкция)',
     'Отлов безнадзорных собак и кошек', 'Некорректное поведение водительского состава', 'Плохое качество воды',
     'Спецпроекты', 'Льготы на проезд и тарифы', 'Поддержка семей мобилизованных', 'Инвалиды',
     '★ Нарушение правил уборки от снега и наледи территории парка и сквера', '★ Наледь и сосульки на кровле',
     'График движения общественного транспорта', 'Пенсионеры и ветераны', 'Государственные услуги',
     '★ Отсутствие урн, лавочек в общественных местах и дворовой территории', 'Детские оздоровительные лагеря',
     'Низкая температура воды/слабое давление', 'Строительство спортивной инфраструктуры',
     '★ Прорыв трубы/трубопровода', 'Безопасность образовательного процесса',
     'Нарушение правил проведения земляных работ', 'Хамство медицинских работников',
     'Зарплата, компенсации, поощрения, выплаты', 'Зарплата учителей', 'Добавить новый маршрут',
     '★ Нестационарная торговля (киоски, павильоны, сезонная торговля)',
     '★ Нарушение правил уборки и вывоза порубочных остатков', 'Ненадлежащее содержание и эксплуатация МКД',
     'Перепланировка и реконструкция помещений', 'Дополнительное образование', 'Дистанционное образование',
     'Строительство объектов по обращению с отходами', 'Отсутствие электричества', 'Отсутствие лекарств в стационарах',
     '★ Несанкционированные надписи, рисунки, реклама на фасаде МКД', 'Освещение неисправно или отсутствует',
     'Непригодные для проживания жилые помещения', '★ Протечки с кровли (системы водостока)',
     'Обустройство асфальтового покрытия парковки, внутридворового проезда, тротуара, пешеходной дорожки, въезда во двор',
     'Низкая заработная плата врачей', 'Раздельная сортировка отходов',
     'Организация переходов, светофоров/Изменить организацию движения', 'Состояние зданий учреждений и организаций',
     'Ремонт спортивных учреждений', 'Памятники и объекты культурного наследия', 'Общее впечатление',
     'Благоустройство придомовых территорий', 'Строительство школ, детских садов', 'Запрос на газификацию и её условия',
     'Улучшение жилищных условий', 'Нехватка материально-технического обеспечения',
     'Работа светофора (установка, изменение режима работы, оборудование кнопкой вызова)', 'Нехватка мест в школах',
     'Отсутствие остановочных пунктов', 'Содержание гос. образовательных организаций',
     'Выбросы вредных веществ в атмосферу/загрязнение воздуха',
     '★ Нарушение правил уборки и вывоза загрязненного снега и наледи на газоне', 'Сертификаты и QR-коды',
     '★ Ненадлежащее состояние игровых элементов на детской или спортивной площадке',
     '★ Несоблюдение правил уборки проезжей части', 'Волонтерство',
     'Проблемы с социальными картами или проездными документами', 'Проблемы в работе горячих линий',
     '★ Подтопление территории', 'Социальная поддержка медперсонала', 'ВУЗы и ССУЗы',
     'Строительство социальных объектов', 'Коронавирусные ограничения', 'Питание', 'ЕГЭ, ОГЭ',
     'Содержание дорожных знаков/Установка новых дорожных знаков, с внесением в схему дислокации, замена старых знаков на новые',
     'Спортивные мероприятия', 'Строительство зданий', 'Выплаты стипендий',
     'Нарушение технологии и (или) сроков производства работ', 'Выбросы вредных веществ в водоёмы/загрязнение водоёмов',
     'Изменение класса и количества автобусов', 'Самоизоляция и карантин', 'Подключение к водоснабжению',
     'Региональное имущество', 'Изменить или отменить маршрут', 'Пробки',
     '★ Нарушение правил уборки внутридворового проезда, пешеходной дорожки', 'Предложение дороги в план ремонта',
     'Отсутствие аптек', 'Выброс мусора нарушителем', 'Ремонт подъездов', 'Санитарно-эпидемиологическое благополучие',
     'Предложения по созданию лечебных центров', 'Проблемы с отоплением детских садов и школ',
     '★ Стихийные свалки в городе/в парках/в лесу',
     'Ненадлежащее состояние фасадов нежилых зданий, объектов и ограждений',
     'Обработка и уничтожение грызунов (дератизация)', 'Погребение и похоронное дело',
     'Другие проблемы с общедомовой системой водоотведения (канализации)', 'Качество электроснабжения',
     'Отсутствие общественных туалетов', 'Беженцы', 'МФЦ "Мои документы"',
     '★ Засор в общедомовой системе водоотведения (канализации)',
     'Несанкционированное ограничение движения, помехи движению, захват земли в полосе отвода автодорог',
     'Архитектура города', 'Социальная поддержка учителей',
     'Установка ограждений, препятствующих въезду на тротуар, газон на дворовой территории МКД',
     'Лифт неисправен или отключен', 'Самовольная установка ограждений на территории общего пользования',
     'Кадровые перестановки', 'Некачественно выполненный ремонт дорог', 'Здравоохранение прочее',
     '★ Повреждение опор ЛЭП', 'Сроки газификации', 'Стоимость, оплата и возврат средств на газификацию',
     '★ Нарушение правил уборки от снега и наледи детской игровой и спортивной площадки', 'Залитие квартиры',
     'Неисправность выступающих конструкций: балконов, козырьков, эркеров, карнизов входных крылец и т. п.',
     'Соц.обслуживание прочее', 'Устройство в ДОУ', '★ Парковка на газонах', 'Матери-одиночки, подростки']
z = ['Благоустройство', 'Социальное обслуживание и защита', 'Общественный транспорт', 'Здравоохранение/Медицина',
     'Мусор/Свалки/ТКО', 'Образование', 'Дороги', 'ЖКХ', 'Коронавирус', 'Экономика и бизнес', 'Культура',
     'Связь и телевидение', 'Газ и топливо', 'Безопасность', 'Спецпроекты', 'Мобилизация', 'МФЦ "Мои документы"',
     'Физическая культура и спорт', 'Торговля', 'Строительство и архитектура',
     'Памятники и объекты культурного наследия', 'Экология', 'Государственная собственность', 'Роспотребнадзор',
     'Погребение и похоронное дело', 'Электроснабжение']


def vectorize(arr, word):
    l = len(arr)
    a = np.zeros(shape=(l))
    pos = arr.index(word)
    a[pos] = 1
    return a


first = tf.keras.models.load_model('/Users/ssq/PycharmProjects/example/Archive/cat_model')
second = tf.keras.models.load_model('/Users/ssq/PycharmProjects/example/Archive/added_model')


def get_embeddings(text):
    v = text.__str__().replace("<br>", " ").replace("\\n", " ")
    v = remove_notalpha(v)
    v = remove_punctuation(v)
    v = remove_numbers(v)

    v = remove_space(v)
    v = tokenize(v)
    v = remove_stopwords(v)
    v = lemmatize(v)
    return model.encode(" ".join(v))

def exec(text):
    global model, first, second
    emb = get_embeddings(text)
    category_vec = first.predict(np.asarray([emb]))[0]
    theme = second.predict((np.asarray([emb]), np.asarray([category_vec])))[0]
    global y, z
    category_text = z[np.argmax(category_vec)]
    theme = y[np.argmax(theme)]
    return category_text, theme


def run():
    global model, first, second
    text = take_from_bd()
    for comment in text:
        emb = get_embeddings(comment[0])
        category_vec = first.predict(np.asarray([emb]))[0]
        theme = second.predict((np.asarray([emb]), np.asarray([category_vec])))[0]
        global y, z
        category_text = z[np.argmax(category_vec)]
        theme = y[np.argmax(theme)]
        print(category_text, theme)
        insert_category_theme(category_text, theme, comment)


def learn(text, category, theme):
    global y, z, first, second
    cat = vectorize(z, category)
    the = vectorize(y, theme)
    emb = get_embeddings(text)
    first.fit(np.asarray([emb]), np.asarray([cat]), epochs=10)
    category_vec = first.predict(np.asarray([emb]))[0]
    second.fit((np.asarray([emb]), np.asarray([category_vec])), np.asarray([the]), epochs=10)

    first.save('/Users/ssq/PycharmProjects/example/Archive/cat_model')
    second.save('/Users/ssq/PycharmProjects/example/Archive/added_model')

# run()